# ==========================================
# 🐱 MeowBot - Configuration
# ==========================================


# ------------------------------------------
# Bot Token
# ------------------------------------------

BOT_TOKEN = "1136047890:50pbkHl72PKOZ-TOgO0k27_mjea_GNEgDms"


# ------------------------------------------
# Owner / Admin
# ------------------------------------------

# آیدی عددی مالک ربات
OWNER_ID = 1967315238


# ------------------------------------------
# Allowed Group
# ------------------------------------------

ALLOWED_GROUP = "@lilililillilililililililili"


# ------------------------------------------
# Game Settings
# ------------------------------------------

# هر ۵ دقیقه یک بار امکان میو کردن
MEOW_COOLDOWN = 5 * 60

# مدت هر فصل
SEASON_DAYS = 30

# حداکثر سطح باشگاه میویی
MAX_GYM_LEVEL = 100

# تعداد نفرات نمایش داده‌شده در رنکینگ
RANKING_LIMIT = 30


# ------------------------------------------
# Database
# ------------------------------------------

DATABASE_NAME = "meow.db"


# ------------------------------------------
# Bot Info
# ------------------------------------------

BOT_NAME = "MeowBot"


# ------------------------------------------
# Cute Emojis 🎀
# ------------------------------------------

MEOW_EMOJIS = [
    "🐱",
    "🎀",
    "🌸",
    "✨",
    "🩷",
]
